meeting/minutes/2026/06-16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 168 Minutes 2026-06-16</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 168 Minutes 2026-06-16</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/10]</code></a></li>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/11]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[0/10]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.3. Close without action</a></li>
<li><a href="#substantive">1.6.4. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#iss-2683">2.1. Issue 2683, Can casting return a subtype of the requested type?</a></li>
<li><a href="#pr-2678">2.2. PR #2678: 2581 XSLT Patterns</a></li>
<li><a href="#pr-2676">2.3. PR #2676: 2672 FLWOR trace clause</a></li>
<li><a href="#pr-2671">2.4. PR #2671: 2668 Drop number-parser option of json-to-xml</a></li>
<li><a href="#pr-2670">2.5. PR #2670: 2669 Add option to ignore empty entries when comparing maps</a></li>
<li><a href="#pr-2667">2.6. PR #2667: 2458 replacement for get() selectors</a></li>
<li><a href="#pr-2589">2.7. PR #2589: 2587 Streamability of context value expressions</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/10]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-01: DB to write a PR for #2641, comments in CSV</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-04: NW to make a PR explaining load-xquery-module for PR #2464</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-06: NW to write a PR to resolve #2169 per GuntherRademacher</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="../2026/06-23.html">at meeting 169</a> on 23 June 2026.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/11]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: CG, BTW
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="off"><code>[&#xa0;]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Alan Painter (AP)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/06-16.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept the minutes of <a href="../../minutes/2026/05-26.html">26 May 2026</a> (teleconference).
</p>

<p>
Accepted.
</p>

<p>
Proposal: Accept the minutes of <a href="../../minutes/2026/06-02.html">2 June 2026</a> (face-to-face).
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 23 June.
</p>

<p>
AP gives regrets.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/10]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-01: DB to write a PR for #2641, comments in CSV</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-04: NW to make a PR explaining load-xquery-module for PR #2464</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-06: NW to write a PR to resolve #2169 per GuntherRademacher</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2594">#2594</a>: 2389 Adaptive Serialization: more freedom</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
</ul>
</div>
</div>
