meeting/minutes/2026/06-16.org
*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2682][#2682]]: 2681 Clarifications for map-for-key() function
+ PR [[https://qt4cg.org/dashboard/#pr-2675][#2675]]: 2664 Allow element-to-map(doc())
+ PR [[https://qt4cg.org/dashboard/#pr-2673][#2673]]: 2590 Editorial Omnibus

Proposal: accept without discussion.

Accepted.

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2518][#2518]]: Type Safety
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2039][#2039]]: Generalize context item to context value in XSLT

Proposal: close without further action.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2678][#2678]]: 2581 XSLT Patterns
+ PR [[https://qt4cg.org/dashboard/#pr-2676][#2676]]: 2672 FLWOR trace clause
+ PR [[https://qt4cg.org/dashboard/#pr-2671][#2671]]: 2668 Drop number-parser option of json-to-xml
+ PR [[https://qt4cg.org/dashboard/#pr-2670][#2670]]: 2669 Add option to ignore empty entries when comparing maps
+ PR [[https://qt4cg.org/dashboard/#pr-2667][#2667]]: 2458 replacement for get() selectors
+ PR [[https://qt4cg.org/dashboard/#pr-2649][#2649]]: 2647 file:descendants: recursion, filtering
+ PR [[https://qt4cg.org/dashboard/#pr-2589][#2589]]: 2587 Streamability of context value expressions

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Issue 2683, Can casting return a subtype of the requested type?
:PROPERTIES:
:CUSTOM_ID: iss-2683
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2683][Issue 2683]]

+ MK: This is a binary decision, so let’s see which the group prefers we write it up.
  + … The spec is contradictory.
+ MK: In general, an expression is allowed to return a subtype of the requested.
  Should that be allowed for constructors and cast expressions?
+ MK: What I want to propose is that the general rule applies, but casts and
  type constructors are an exception to that rule.
+ NW: I think that makes sense.
+ JLO: I think the question will be, will we see any errors from this?
  + … It would only raise an error when you do a cast to decimal and then do instance of and it isn’t a decimal.
+ MK: The general rule does mean that you can write things that aren’t interoperable.
  + If Saxon returns ~4 div 2~ as an integer and BaseX returns it as a decimal, you might not have interoperable code.
  + If you’re calling a user defined function, you can’t constain a user defined function to return an integer when it’s declared type is decimal.
  + Why shouldn’t the same rule apply to system defined functions?
+ JLO: In my head, I think we might want to say that you have to return the type
  specified and the implementation may used a value internally that’s unchanged.
  + Treat it as a boxed value.
+ MK: We clearly can’t do that with user defined functions.
+ JLO: Maybe I’m not sure what you mean.
+ MK: If a function declares a return type of ~xs:integer?~, you can return ~()~ which is a more specific type.
  + … Maybe that’s a bad example. Let’s say it returns ~xs:decimal~ and on one branch of a choose you return ~0~, that’s an integer.
  + … We don’t cast that to a decimal, it comes back as the integer 0 and ~instance of~ will say it’s an integer.
+ JLO: I’m not sure. I’d really expect that if it says it returns decimal, that’s what I get back.
+ MK: That would clearly be problematic.
+ JWL: If you’re calling a function that expects an ~xs:decimal~, you can pass in an integer. That’s fine.
  + … It’s effectively symmetric on the way out.
  + … What you require is a ~xs:decimal~ but an integer is a decimal.
+ MK: It’s basically the principle of substitutability, which you can break with ~instance of~.
+ JLO: Okay, I think this makes more sense. But we need to make it clear that ~instance of~ may not do what you think it does.
  + … You may need to do something else. Maybe ~castable as~.
+ MK: The ~instance of~ check works if it belongs to a subtype.

Some discussion of where the problem arises. If you test if the value returned
is an integer, then you may see different results from different
implementations.

Consensus: go with Mike’s proposal for a special case.

