meeting/minutes/2026/06-16.html
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2682">#2682</a>: 2681 Clarifications for map-for-key() function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2675">#2675</a>: 2664 Allow element-to-map(doc())</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2673">#2673</a>: 2590 Editorial Omnibus</li>
</ul>

<p>
Proposal: accept without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2518">#2518</a>: Type Safety</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2039">#2039</a>: Generalize context item to context value in XSLT</li>
</ul>

<p>
Proposal: close without further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2678">#2678</a>: 2581 XSLT Patterns</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2676">#2676</a>: 2672 FLWOR trace clause</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2671">#2671</a>: 2668 Drop number-parser option of json-to-xml</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2670">#2670</a>: 2669 Add option to ignore empty entries when comparing maps</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2667">#2667</a>: 2458 replacement for get() selectors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2649">#2649</a>: 2647 <a href="descendants">descendants</a>: recursion, filtering</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2589">#2589</a>: 2587 Streamability of context value expressions</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-iss-2683" class="outline-3">
<h3 id="iss-2683"><span class="section-number-3">2.1.</span> Issue 2683, Can casting return a subtype of the requested type?</h3>
<div class="outline-text-3" id="text-iss-2683">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2683">Issue 2683</a>
</p>

<ul class="org-ul">
<li>MK: This is a binary decision, so let’s see which the group prefers we write it up.
<ul class="org-ul">
<li>… The spec is contradictory.</li>
</ul></li>
<li>MK: In general, an expression is allowed to return a subtype of the requested.
Should that be allowed for constructors and cast expressions?</li>
<li>MK: What I want to propose is that the general rule applies, but casts and
type constructors are an exception to that rule.</li>
<li>NW: I think that makes sense.</li>
<li>JLO: I think the question will be, will we see any errors from this?
<ul class="org-ul">
<li>… It would only raise an error when you do a cast to decimal and then do instance of and it isn’t a decimal.</li>
</ul></li>
<li>MK: The general rule does mean that you can write things that aren’t interoperable.
<ul class="org-ul">
<li>If Saxon returns <code>4 div 2</code> as an integer and BaseX returns it as a decimal, you might not have interoperable code.</li>
<li>If you’re calling a user defined function, you can’t constain a user defined function to return an integer when it’s declared type is decimal.</li>
<li>Why shouldn’t the same rule apply to system defined functions?</li>
</ul></li>
<li>JLO: In my head, I think we might want to say that you have to return the type
specified and the implementation may used a value internally that’s unchanged.
<ul class="org-ul">
<li>Treat it as a boxed value.</li>
</ul></li>
<li>MK: We clearly can’t do that with user defined functions.</li>
<li>JLO: Maybe I’m not sure what you mean.</li>
<li>MK: If a function declares a return type of <code>xs:integer?</code>, you can return <code>()</code> which is a more specific type.
<ul class="org-ul">
<li>… Maybe that’s a bad example. Let’s say it returns <code>xs:decimal</code> and on one branch of a choose you return <code>0</code>, that’s an integer.</li>
<li>… We don’t cast that to a decimal, it comes back as the integer 0 and <code>instance of</code> will say it’s an integer.</li>
</ul></li>
<li>JLO: I’m not sure. I’d really expect that if it says it returns decimal, that’s what I get back.</li>
<li>MK: That would clearly be problematic.</li>
<li>JWL: If you’re calling a function that expects an <code>xs:decimal</code>, you can pass in an integer. That’s fine.
<ul class="org-ul">
<li>… It’s effectively symmetric on the way out.</li>
<li>… What you require is a <code>xs:decimal</code> but an integer is a decimal.</li>
</ul></li>
<li>MK: It’s basically the principle of substitutability, which you can break with <code>instance of</code>.</li>
<li>JLO: Okay, I think this makes more sense. But we need to make it clear that <code>instance of</code> may not do what you think it does.
<ul class="org-ul">
<li>… You may need to do something else. Maybe <code>castable as</code>.</li>
</ul></li>
<li>MK: The <code>instance of</code> check works if it belongs to a subtype.</li>
</ul>

<p>
Some discussion of where the problem arises. If you test if the value returned
is an integer, then you may see different results from different
implementations.
</p>

<p>
Consensus: go with Mike’s proposal for a special case.
</p>
</div>
</div>
