meeting/minutes/2026/06-16.org
** PR #2678: 2581 XSLT Patterns
:PROPERTIES:
:CUSTOM_ID: pr-2678
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2678][#2678]]

+ MK: I suggest we go through the non-diff version. The diff makes it looks like a bigger change than it is.
+ MK: The changes are in /Patterns, 6.3/. I’ve flattened things slightly.
  + … Patterns now fall into six groups at the top level: predicate, type, XNode, map, array, and JNode.
  + … Predicate and type patterns haven’t changed.
  + … XNodes are clarified that they only apply to XNodes
  + … Map patterns are extended by this proposal.
  + … Array and JNode patterns are new.
+ MK: Sequence patterns aren’t a top level kind of pattern, but they’re used by several others.
  + … They match a sequence; the empty sequence of an item type plus an occurrence indicator.
+ MK: Map patterns change primarily by the addition of ~,*~ to say that it’s extensible.
  + … For example, ~{}~ matches an empty map, ~{*}~ matches any map, ~{"first", "last"}~ matches a map
    containing first and last, ~{"first", "last", *}~ matches  a map that contains first and last and maybe other things.
  + … The key has to be a constant
  + … And there are a number of examples, including ~{"elements": **, *}~ (!!!)

MK observes that some of these ideas come from a white boarding exercise that we did in Prague.

+ MK: Array patterns is just array with a sequence pattern inside.
  + … Every member has to match the sequence pattern, you can’t match heterogenous arrays.
+ MK: Finally, JNode patterns match JNodes.
  + … You specify a selector part (the key part) and then a pattern to match the value part.
  + … And then there are examples.

There is an editorial error, the list of 1 to 7 after the green box of examples should be removed.

+ MK: The section on default priorities is changed, but just to ensure that every kind of rule has a default priority.

+ JLO: I like it. Remind me why the tilde character is necessary.
+ MK: The tilde character says that the pattern matches a type. It turns any type into a pattern. That’s not new.
+ JLO: Is it true for arrays as well?
+ MK: It’s somewhat confusing because there are both types and patterns for arrays and they’re not the same.
  + … I was half thinking that I might try to reduce some of the scope for using types as patterns to avoid some of the overlap.
  + … But at the moment, it is the way it is.
+ AP: You mentioned that you can’t match heterogenous arrays? Can’t you use union types?
+ MK: Yes, but you can’t say the first member is a string and the second is something else.
+ JK: One suggestion on sequence patterns, perhaps we should name that “pattern
  sequences” to avoid ambiguity over the name. (In case we do want to match sequences in the future.)

Proposal: accept this PR.

Accepted.

MK to remove the errant list and then do the merge.

** PR #2676: 2672 FLWOR trace clause
:PROPERTIES:
:CUSTOM_ID: pr-2676
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2676][#2676]]

+ MK: This was CG’s suggestion that I implemented.
  + … Though it may have been something I suggested long ago!
+ MK: This PR adds a trace clause to FLWOR expressions as an intermediate clause.
  + … It takes an ~ExprSingle~ as the argument; the expression is evaluated and some record of its value should be presented.
  + … It has no effects on the results of the expression.
  + … If an error occurs, report it on the trace output destination and otherwise ignore it
+ MK: There’s an example. With some advice to implementors and users.

Proposal: accept this PR.

Accepted.

** PR #2671: 2668 Drop number-parser option of json-to-xml
:PROPERTIES:
:CUSTOM_ID: pr-2671
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2671][#2671]]

+ MK: This was an oversight; we dropped it from one function but not another.
  + … By and large, the XML can contain the number in the original format, so there’s no great need for the number parser.
  + … It was there primarily for compatibility with ~parse-json~, but we’ve dropped it there.

Proposal: accept this PR.

Accepted.

** PR #2670: 2669 Add option to ignore empty entries when comparing maps
:PROPERTIES:
:CUSTOM_ID: pr-2670
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2670][#2670]]

+ MK: This arose from all the discussions about build date time records and
  whether absent fields should be absent or empty.
  + … For many purposes, you don’t care. If you’re looking at the results of a
    test case, you might want deep-equal to treat them as the same.
+ MK: It’s a new option ~ignore-empty-entries~ on ~fn:deep-equal~.
  + … It effects how you compare maps. It defines a “significant” entry to simplify the prose.
+ WP: Have you consider instead or in addition a function that would scrub a map, removing all the empty entries?
+ MK: No, I didn’t think of that. There are ways of filtering with the ~map-filter~ function.
+ WP: I guess this is a nice to have.
+ JLO: I like this. Why don’t we make this true by default?
+ NW: I’d say “because it hasn’t historically been this way.”

Some discussion of the circumstances under which the distinction might be significant.

+ MK: I think that’s going too far.

Proposal: accept this PR.

Accepted.

