meeting/minutes/2026/06-16.html
<div id="outline-container-pr-2678" class="outline-3">
<h3 id="pr-2678"><span class="section-number-3">2.2.</span> PR #2678: 2581 XSLT Patterns</h3>
<div class="outline-text-3" id="text-pr-2678">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2678">#2678</a>
</p>

<ul class="org-ul">
<li>MK: I suggest we go through the non-diff version. The diff makes it looks like a bigger change than it is.</li>
<li>MK: The changes are in <i>Patterns, 6.3</i>. I’ve flattened things slightly.
<ul class="org-ul">
<li>… Patterns now fall into six groups at the top level: predicate, type, XNode, map, array, and JNode.</li>
<li>… Predicate and type patterns haven’t changed.</li>
<li>… XNodes are clarified that they only apply to XNodes</li>
<li>… Map patterns are extended by this proposal.</li>
<li>… Array and JNode patterns are new.</li>
</ul></li>
<li>MK: Sequence patterns aren’t a top level kind of pattern, but they’re used by several others.
<ul class="org-ul">
<li>… They match a sequence; the empty sequence of an item type plus an occurrence indicator.</li>
</ul></li>
<li>MK: Map patterns change primarily by the addition of <code>,*</code> to say that it’s extensible.
<ul class="org-ul">
<li>… For example, <code>{}</code> matches an empty map, <code>{*}</code> matches any map, <code>{"first", "last"}</code> matches a map
containing first and last, <code>{"first", "last", *}</code> matches  a map that contains first and last and maybe other things.</li>
<li>… The key has to be a constant</li>
<li>… And there are a number of examples, including <code>{"elements": **, *}</code> (!!!)</li>
</ul></li>
</ul>

<p>
MK observes that some of these ideas come from a white boarding exercise that we did in Prague.
</p>

<ul class="org-ul">
<li>MK: Array patterns is just array with a sequence pattern inside.
<ul class="org-ul">
<li>… Every member has to match the sequence pattern, you can’t match heterogenous arrays.</li>
</ul></li>
<li>MK: Finally, JNode patterns match JNodes.
<ul class="org-ul">
<li>… You specify a selector part (the key part) and then a pattern to match the value part.</li>
<li>… And then there are examples.</li>
</ul></li>
</ul>

<p>
There is an editorial error, the list of 1 to 7 after the green box of examples should be removed.
</p>

<ul class="org-ul">
<li>MK: The section on default priorities is changed, but just to ensure that every kind of rule has a default priority.</li>

<li>JLO: I like it. Remind me why the tilde character is necessary.</li>
<li>MK: The tilde character says that the pattern matches a type. It turns any type into a pattern. That’s not new.</li>
<li>JLO: Is it true for arrays as well?</li>
<li>MK: It’s somewhat confusing because there are both types and patterns for arrays and they’re not the same.
<ul class="org-ul">
<li>… I was half thinking that I might try to reduce some of the scope for using types as patterns to avoid some of the overlap.</li>
<li>… But at the moment, it is the way it is.</li>
</ul></li>
<li>AP: You mentioned that you can’t match heterogenous arrays? Can’t you use union types?</li>
<li>MK: Yes, but you can’t say the first member is a string and the second is something else.</li>
<li>JK: One suggestion on sequence patterns, perhaps we should name that “pattern
sequences” to avoid ambiguity over the name. (In case we do want to match sequences in the future.)</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>

<p>
MK to remove the errant list and then do the merge.
</p>
</div>
</div>
<div id="outline-container-pr-2676" class="outline-3">
<h3 id="pr-2676"><span class="section-number-3">2.3.</span> PR #2676: 2672 FLWOR trace clause</h3>
<div class="outline-text-3" id="text-pr-2676">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2676">#2676</a>
</p>

<ul class="org-ul">
<li>MK: This was CG’s suggestion that I implemented.
<ul class="org-ul">
<li>… Though it may have been something I suggested long ago!</li>
</ul></li>
<li>MK: This PR adds a trace clause to FLWOR expressions as an intermediate clause.
<ul class="org-ul">
<li>… It takes an <code>ExprSingle</code> as the argument; the expression is evaluated and some record of its value should be presented.</li>
<li>… It has no effects on the results of the expression.</li>
<li>… If an error occurs, report it on the trace output destination and otherwise ignore it</li>
</ul></li>
<li>MK: There’s an example. With some advice to implementors and users.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2671" class="outline-3">
<h3 id="pr-2671"><span class="section-number-3">2.4.</span> PR #2671: 2668 Drop number-parser option of json-to-xml</h3>
<div class="outline-text-3" id="text-pr-2671">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2671">#2671</a>
</p>

<ul class="org-ul">
<li>MK: This was an oversight; we dropped it from one function but not another.
<ul class="org-ul">
<li>… By and large, the XML can contain the number in the original format, so there’s no great need for the number parser.</li>
<li>… It was there primarily for compatibility with <code>parse-json</code>, but we’ve dropped it there.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2670" class="outline-3">
<h3 id="pr-2670"><span class="section-number-3">2.5.</span> PR #2670: 2669 Add option to ignore empty entries when comparing maps</h3>
<div class="outline-text-3" id="text-pr-2670">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2670">#2670</a>
</p>

<ul class="org-ul">
<li>MK: This arose from all the discussions about build date time records and
whether absent fields should be absent or empty.
<ul class="org-ul">
<li>… For many purposes, you don’t care. If you’re looking at the results of a
test case, you might want deep-equal to treat them as the same.</li>
</ul></li>
<li>MK: It’s a new option <code>ignore-empty-entries</code> on <code>fn:deep-equal</code>.
<ul class="org-ul">
<li>… It effects how you compare maps. It defines a “significant” entry to simplify the prose.</li>
</ul></li>
<li>WP: Have you consider instead or in addition a function that would scrub a map, removing all the empty entries?</li>
<li>MK: No, I didn’t think of that. There are ways of filtering with the <code>map-filter</code> function.</li>
<li>WP: I guess this is a nice to have.</li>
<li>JLO: I like this. Why don’t we make this true by default?</li>
<li>NW: I’d say “because it hasn’t historically been this way.”</li>
</ul>

<p>
Some discussion of the circumstances under which the distinction might be significant.
</p>

<ul class="org-ul">
<li>MK: I think that’s going too far.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
