meeting/minutes/2026/06-16.org
** PR #2667: 2458 replacement for get() selectors
:PROPERTIES:
:CUSTOM_ID: pr-2667
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2667][#2667]]

+ MK: No one, including me, has ever been very happy with the ~get()~ expression in selectors.
  + … It was original designed for selecting keys where the key might not be a string or might contain spaces.
+ MK: Mostly, we just replace that with new syntax.
  + … Hopefully the meaning of ~ancestor::{$name}~ is clear.
+ MK: We rewrite the rules for evaluating slash expressions, mostly for editorial clarity.
  + … The XNodes and JNodes cases are now separated.
  + … For JNodes, the semantics of nodes vs atomic items differ so that atomics select keys with that value.
+ MK: The grammar now adds ~EnclosedExpr~ to the right hand side of ~NodeTest~
  + … The ~EnclosedExpr~ is typically used to select a member.
  + … The get option of a selector is replaced by the ~EnclosedExpr~.
  + … The ~get()~ was more constrained syntactically than an ~EnclosedExpr~.
+ MK: The expression must match the name of an XNode or JNode.
  + … Multiple values can appear in the enclosed expression, selecting all the matches.
+ MK: The rest is just changing examples.
+ JWL: Two things. When you’re talking about evaluating E1/E2; it might be worth
  noting that you can only get maps and arrays in that sequence at the top
  level. You can have XNodes below maps and arrays but not the other way around.
  + … When you’re doing a computed name, you could do that in patterns as well, couldn’t you?
+ MK: Not with the syntax at the moment.
+ JWL: You can have a ~let~ inside a predicate so you can work up and down.
+ MK: But at the level of ~/a/b/c~, the syntax isn’t there yet.
+ JLO: It feels natural with the curly braces. I can select XNodes also, yes?
+ MK: Yes.
+ JLO: For the note that you can never have JNodes selected from inside an XNode, that might change.
+ MK: Not directly. You can do it indirectly, if you have a node inside a map
  and you select the map and then select the entry, that result is going to be
  JNode containing an XNode.
  + … There are places where that will automatically be dereferenced.
  + … Some things are going to work and others aren’t.
+ JLO: I really like that I can write ~a/3~.

Some discussion of the presence (or absence) of the tilde in path expressions.

Proposal: accept this PR.

Accepted.

** PR #2589: 2587 Streamability of context value expressions
:PROPERTIES:
:CUSTOM_ID: pr-2589
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2589][#2589]]

+ MK: I think this one isn’t as scary as you might imagine.
  + … /12.7.7 Streamability of Pipeline Expressions/ is new.
  + … There are three rules based on the cardinality of the left hand operand.

Proposal: accept this PR.

Accepted.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
