meeting/minutes/2026/06-16.html
<div id="outline-container-pr-2667" class="outline-3">
<h3 id="pr-2667"><span class="section-number-3">2.6.</span> PR #2667: 2458 replacement for get() selectors</h3>
<div class="outline-text-3" id="text-pr-2667">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2667">#2667</a>
</p>

<ul class="org-ul">
<li>MK: No one, including me, has ever been very happy with the <code>get()</code> expression in selectors.
<ul class="org-ul">
<li>… It was original designed for selecting keys where the key might not be a string or might contain spaces.</li>
</ul></li>
<li>MK: Mostly, we just replace that with new syntax.
<ul class="org-ul">
<li>… Hopefully the meaning of <code>ancestor::{$name}</code> is clear.</li>
</ul></li>
<li>MK: We rewrite the rules for evaluating slash expressions, mostly for editorial clarity.
<ul class="org-ul">
<li>… The XNodes and JNodes cases are now separated.</li>
<li>… For JNodes, the semantics of nodes vs atomic items differ so that atomics select keys with that value.</li>
</ul></li>
<li>MK: The grammar now adds <code>EnclosedExpr</code> to the right hand side of <code>NodeTest</code>
<ul class="org-ul">
<li>… The <code>EnclosedExpr</code> is typically used to select a member.</li>
<li>… The get option of a selector is replaced by the <code>EnclosedExpr</code>.</li>
<li>… The <code>get()</code> was more constrained syntactically than an <code>EnclosedExpr</code>.</li>
</ul></li>
<li>MK: The expression must match the name of an XNode or JNode.
<ul class="org-ul">
<li>… Multiple values can appear in the enclosed expression, selecting all the matches.</li>
</ul></li>
<li>MK: The rest is just changing examples.</li>
<li>JWL: Two things. When you’re talking about evaluating E1/E2; it might be worth
noting that you can only get maps and arrays in that sequence at the top
level. You can have XNodes below maps and arrays but not the other way around.
<ul class="org-ul">
<li>… When you’re doing a computed name, you could do that in patterns as well, couldn’t you?</li>
</ul></li>
<li>MK: Not with the syntax at the moment.</li>
<li>JWL: You can have a <code>let</code> inside a predicate so you can work up and down.</li>
<li>MK: But at the level of <code>/a/b/c</code>, the syntax isn’t there yet.</li>
<li>JLO: It feels natural with the curly braces. I can select XNodes also, yes?</li>
<li>MK: Yes.</li>
<li>JLO: For the note that you can never have JNodes selected from inside an XNode, that might change.</li>
<li>MK: Not directly. You can do it indirectly, if you have a node inside a map
and you select the map and then select the entry, that result is going to be
JNode containing an XNode.
<ul class="org-ul">
<li>… There are places where that will automatically be dereferenced.</li>
<li>… Some things are going to work and others aren’t.</li>
</ul></li>
<li>JLO: I really like that I can write <code>a/3</code>.</li>
</ul>

<p>
Some discussion of the presence (or absence) of the tilde in path expressions.
</p>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2589" class="outline-3">
<h3 id="pr-2589"><span class="section-number-3">2.7.</span> PR #2589: 2587 Streamability of context value expressions</h3>
<div class="outline-text-3" id="text-pr-2589">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2589">#2589</a>
</p>

<ul class="org-ul">
<li>MK: I think this one isn’t as scary as you might imagine.
<ul class="org-ul">
<li>… <i>12.7.7 Streamability of Pipeline Expressions</i> is new.</li>
<li>… There are three rules based on the cardinality of the left hand operand.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
